Repository: aracnus/documentation
Catalog: user_manual/locale/*.rios/LC_MESSAGES/files/access_webgui.po
Languages: pt_br

source: Accessing your files using the Nextcloud Web interface
pt_br: Acessar seus arquivos utilizando a interface Web do RIOS

source: You can access your Nextcloud files with the Nextcloud Web interface and create, preview, edit, delete, share, and re-share files. Your Nextcloud administrator has the option to disable these features, so if any of them are missing on your system ask your server administrator.
pt_br: Você pode acessar seus arquivos com a interface web do RIOS e criar, visualizar, editar, excluir, compartilhar e re-compartilhar arquivos. O administrador do RIOS tem a opção de desativar esses recursos. Portanto, se algum deles estiver faltando no sistema, peça ao administrador do servidor.

source: Tagging files
pt_br: Etiquetar arquivos

source: You can assign tags to files. To create tags, open a file to the Details view. Then type your tags. To enter more than one tag press the return key after creating each tag. All tags are system tags, and are shared by all users on your Nextcloud server.
pt_br: Você pode atribuir etiquetas aos arquivos e pastas. Para criar as etiquetas, abra a visualização de detalhes do arquivo/pasta (ícone "..." e opção "Detalhes"). Em seguida, clique no novo ícone "..." que aparece ao lado do nome do arquivo/pasta à direita, selecione "Etiquetas" e digite suas etiquetas. Para inserir mais de uma, pressione a tecla Enter após cada uma delas. Todas as etiquetas se tornam disponíveis para o sistema e são compartilhadas por todos os usuários no servidor RIOS.

source: Then use the Tags filter on the left sidebar to filter files by tags:
pt_br: A partir daí, você pode usar o filtro Etiquetas na barra lateral esquerda para exibir arquivos baseados em suas etiquetas:

source: Comments
pt_br: Comentários

source: Use the Details view to add and read comments on any file or folder. Comments are visible to everyone who has access to the file:
pt_br: Use a visualização dos Detalhes (ícone "..." e opção "Detalhes") para adicionar e ler comentários em qualquer arquivo ou pasta. Os comentários são visíveis para todos que têm acesso ao arquivo:

source: Video player
pt_br: Reprodução de vídeos

source: You can play videos in Nextcloud with the Video Player app by simply clicking on the file. Video streaming by the native Nextcloud video player depends on your Web browser and the video format. If your Nextcloud administrator has enabled video streaming, and it doesn't work in your Web browser, it may be a browser issue. See https://developer.mozilla.org/en-US/docs/Web/HTML/Supported_media_formats#Browser_compatibility for supported multimedia formats in Web browsers.
pt_br: Você pode reproduzir vídeos no Nextcloud com o aplicativo Video Player simplesmente clicando no arquivo. A transmissão de vídeo pelo reprodutor de vídeo nativo Nextcloud depende do seu navegador Web e do formato do vídeo. Se o administrador do Nextcloud ativou a transmissão de vídeo e não funciona no seu navegador da Web, pode ser um problema no navegador. Consulte https://developer.mozilla.org/en-US/docs/Web/HTML/Supported_media_formats#Browser_compatibility para obter os formatos multimídia suportados nos navegadores da Web.

source: File controls
pt_br: Controles de arquivo

source: Nextcloud can display thumbnail previews for image files, MP3 covers, and text files, if this enabled by your server administrator. Hover your cursor over a file or folder to expose the controls for the following operations:
pt_br: O RIOS pode exibir visualizações em miniatura de arquivos de imagem, capas de MP3 e arquivos de texto, se isso estiver ativado pelo administrador do servidor. Clique no ícone "..." à direita do arquivo ou pasta para abrir o menu com os controles para as seguintes operações:

source: Favorites
pt_br: Adicionar aos favoritos

source: Click the star to the left of the file icon to mark it as a favorite:
pt_br: Clique nessa opção para marcar o arquivo/pasta como favorito.

source: You can also quickly find all of your favorites with the Favorites filter on the left sidebar.
pt_br: Você pode encontrar rapidamente todos os seus favoritos usando a opção "Favoritos", disponível no painel lateral esquerdo.

source: Overflow Menu
pt_br: Menu flutuante

source: The Overflow menu (three dots) displays file details, and allows you to rename, download, or delete files:
pt_br: O menu flutuante (três pontos) exibe os detalhes do arquivo e permite que você renomeie, baixe ou exclua arquivos:

source: The Details view shows Activities, Sharing, and Versions information:
pt_br: A visualização Detalhes mostra informações sobre Atividades, Compartilhamento e Versões:

source: The **Settings** gear icon at the lower left allows you to show or hide hidden files in your Nextcloud Web interface. These are also called dotfiles, because they are prefixed with a dot, e.g. ``.mailfile``. The dot tells your operating system to hide these files in your file browsers, unless you choose to display them. Usually these are configuration files, so having the option to hide them reduces clutter.
pt_br: O ícone de engrenagem **Configurações** no canto inferior esquerdo permite ocultar ou mostrar arquivos ocultos na interface Web do Nextcloud. Esses também são chamados de arquivos de ponto, porque são prefixados com um ponto, por exemplo `` .mailfile``. O ponto indica ao sistema operacional para ocultar esses arquivos nos navegadores de arquivos, a menos que você escolha exibi-los. Geralmente, esses são arquivos de configuração, portanto, ter a opção de ocultá-los reduz a confusão.

source: Previewing files
pt_br: Visualizar arquivos

source: You can display uncompressed text files, OpenDocument files, videos, and image files in the Nextcloud embedded viewers by clicking on the file name. There may be other file types you can preview if your Nextcloud administrator has enabled them. If Nextcloud cannot display a file, it starts a download process and downloads the file to your computer.
pt_br: Você pode exibir arquivos de texto não compactados, arquivos OpenDocument, vídeos e arquivos de imagem nos visualizadores incorporados do Nextcloud, clicando no nome do arquivo. Pode haver outros tipos de arquivo que você pode visualizar se o administrador do Nextcloud os tiver ativado. Se o Nextcloud não puder exibir um arquivo, ele inicia um processo de download e baixa o arquivo no seu computador.

source: Navigating inside your Nextcloud
pt_br: Navegar pelo RIOS

source: Navigating through folders in Nextcloud is as simple as clicking on a folder to open it and using the back button on your browser to move to a previous level. Nextcloud also provides a navigation bar at the top of the Files field for quick navigation.
pt_br: Navegar pelas pastas no RIOS é muito simples: basta clicar em uma pasta para abri-la e usar o botão voltar no seu navegador para retornar ao nível anterior. O RIOS também fornece uma barra de navegação na parte superior da tela dos Arquivos, para uma navegação rápida.

source: Sharing status icons
pt_br: Ícones de status do compartilhamento

source: Any folder that has been shared is marked with the ``Shared`` overlay icon. Public link shares are marked with a chain link. Unshared folders are not marked:
pt_br: Qualquer pasta compartilhada é marcada com o ícone de sobreposição ``Compartilhado``. Os compartilhamentos de links públicos são marcados com um elo de corrente. As pastas não compartilhadas não são marcadas:

source: Creating or uploading files and directories
pt_br: Criar ou enviar arquivos e diretórios

source: Upload or create new files or folders directly in a Nextcloud folder by clicking on the *New* button in the Files app:
pt_br: Envie ou crie novos arquivos ou pastas diretamente em uma pasta do RIOS, clicando no botão *Novo* no aplicativo Arquivos:

source: The *New* button provides the following options:
pt_br: O botão *Novo* fornece as seguintes opções:

source: Up arrow
pt_br: Enviar arquivo

source: Upload files from your computer into Nextcloud. You can also upload files by dragging and dropping them from your file manager.
pt_br: Envia arquivos do seu computador para o Nextcloud. Você também pode enviar arquivos, arrastando-os do seu gerenciador de arquivos e soltando-os na tela do RIOS.

source: Text file
pt_br: Novo documento de texto

source: Creates a new text file and adds the file to your current folder.
pt_br: Cria um novo arquivo de texto e o adiciona à sua pasta atual.

source: Folder
pt_br: Nova pasta

source: Creates a new folder in the current folder.
pt_br: Cria uma nova pasta na pasta atual.

source: Selecting files or folders
pt_br: Selecionar arquivos ou pastas

source: You can select one or more files or folders by clicking on their checkboxes. To select all files in the current directory, click on the checkbox located at the top of the files listing.
pt_br: Você pode selecionar um ou mais arquivos e pastas clicando nas caixas de seleção localizadas à esquerda do nome deles. Para selecionar todos os arquivos e pastas da pasta atual, clique na caixa de seleção localizada na parte superior da lista de arquivos/pastas.

source: When you select multiple files, you can delete all of them, or download them as a ZIP file by using the ``Delete`` or ``Download`` buttons that appear at the top.
pt_br: Ao selecionar vários arquivos, você pode excluir todos eles ou baixá-los como um arquivo ZIP usando os botões "Excluir" ou "Baixar" que aparecem na parte superior.

source: If the ``Download`` button is not visible, the administrator has disabled this feature.
pt_br: Se o botão "Download" não estiver visível, o administrador desativou esse recurso.

source: Filtering the files view
pt_br: Filtros de visualização de arquivos

source: The left sidebar on the Files page contains several filters for quickly sorting and managing your files.
pt_br: O painel lateral esquerdo na página Arquivos contém vários filtros para ordenar e gerenciar rapidamente seus arquivos.

source: All files
pt_br: Todos os arquivos

source: The default view; displays all files that you have access to.
pt_br: A visualização padrão. Exibe todos os arquivos aos quais você tem acesso.

source: Files or folders marked with the yellow star.
pt_br: Arquivos ou pastas marcados como favoritos (estrela amarela).

source: Shared with you
pt_br: Compartilhado com você

source: Displays all files shared with you by another user or group.
pt_br: Exibe todos os arquivos que outros usuários ou grupos compartilharam com você.

source: Shared with others
pt_br: Compartilhado com outros

source: Displays all files that you have shared with other users or groups.
pt_br: Exibe todos os arquivos que você compartilhou com outros usuários ou grupos.

source: Shared by link
pt_br: Compartilhado por link

source: Displays all files that are shared by you via public link.
pt_br: Exibe todos os arquivos compartilhados por você por meio de link público.

source: External Storage (optional)
pt_br: Armazenamento externo (opcional)

source: Files that you have access to on external storage devices and services such as Amazon S3, SMB/CIFS, FTP…
pt_br: Arquivos aos quais você tem acesso em dispositivos e serviços de armazenamento externos, como Amazon S3, SMB/CIFS, FTP...

source: Moving files
pt_br: Movendo arquivos

source: You can move files and folders by dragging and dropping them into any directory.
pt_br: Você pode mover arquivos e pastas arrastando-os e soltando-os em qualquer outra pasta.

source: Creating or connecting to a Federation Share link
pt_br: Criando ou conectando-se a um link de Compartilhamento Federado

source: Federated Cloud Sharing allows you to mount file shares from remote Nextcloud servers, and manage them just like a local share. See :doc:`federated_cloud_sharing` to learn to how to create and connect to new Federated Cloud shares.
pt_br: O Compartilhamento de Nuvem Federada permite montar compartilhamentos de arquivos de servidores remotos Nextcloud e gerenciá-los como um compartilhamento local. Consulte :doc: `federated_cloud_sharing` para aprender como criar e conectar-se a novos compartilhamentos de Nuvem Federada.
