Repository: aracnus/documentation
Catalog: user_manual/locale/*.rios/LC_MESSAGES/files/federated_cloud_sharing.po
Languages: pt_br

source: Using Federation Shares
pt_br: Usando Compartilhamentos Federados

source: Federation Sharing allows you to mount file shares from remote Nextcloud servers, in effect creating your own cloud of Nextclouds. You can create direct share links with users on other Nextcloud servers.
pt_br: O Compartilhamento de Nuvem Federada permite montar compartilhamentos de arquivos de servidores remotos RIOS. Você pode criar links de compartilhamento direto com usuários em outros servidores RIOS.

source: Creating a new Federation Share
pt_br: Criando um novo Compartilhamento Federado

source: Federation sharing is enabled on new or upgraded Nextcloud installations by default. Follow these steps to create a new share with other Nextcloud or ownCloud 9+ servers:
pt_br: O compartilhamento de federação é habilitado em instalações RIOS novas ou atualizadas por padrão. Siga estas etapas para criar um novo compartilhamento com outros servidores RIOS ou ownCloud 9+:

source: 1. Go to your ``Files`` page and click the **Share** icon on the file or directory you want to share. In the sidebar enter the username and URL of the remote user in this form: ``<username>@<oc-server-url>``. The form automatically confirms the address that you type and labels it as "remote". Click on the label.
pt_br: 1. Vá para a página ''Arquivos'' e clique no ícone **Compartilhar** no arquivo ou diretório que deseja compartilhar. Na barra lateral digite o nome de usuário e a URL do usuário remoto neste formulário: ``<username>@<oc-server-url>``. O formulário confirma automaticamente o endereço digitado e o rotula como "remoto". Clique no rótulo.

source: 2. When your local Nextcloud server makes a successful connection with the remote Nextcloud server you'll see a confirmation. Your only share option is **Can edit**.
pt_br: 2. Quando o servidor RIOS local fizer uma conexão bem-sucedida com o servidor RIOS remoto, você verá uma confirmação. Sua única opção de compartilhamento é ** Pode editar **.

source: Click the Share button anytime to see who you have shared your file with. Remove your linked share anytime by clicking the trash can icon. This only unlinks the share, and does not delete any files.
pt_br: Clique no botão Compartilhar a qualquer momento para ver com quem você compartilhou seu arquivo. Remova seu compartilhamento vinculado a qualquer momento clicando no ícone da lixeira. Isso apenas desvincula o compartilhamento e não exclui nenhum arquivo.

source: Creating a new Federated Cloud Share via email
pt_br: Criação de um novo compartilhamento de nuvem federado por e-mail

source: Use this method when you are sharing with users on ownCloud 8.x and older.
pt_br: Use este método quando estiver compartilhando com usuários no ownCloud 8.x e anteriores.

source: What if you do not know the username or URL? Then you can have Nextcloud create the link for you and email it to your recipient.
pt_br: E se você não souber o nome de usuário ou URL? Em seguida, você pode fazer com que o RIOS crie o link para você e o envie por e-mail ao seu destinatário.

source: When your recipient receives your email they will have to take a number of steps to complete the share link. First they must open the link you sent them in a Web browser, and then click the **Add to your Nextcloud** button.
pt_br: Quando o destinatário receber seu e-mail, ele terá que seguir várias etapas para preencher o link de compartilhamento. Primeiro, eles devem abrir o link que você enviou em um navegador da Web e, em seguida, clicar no botão ** Adicionar ao RIOS **.

source: The **Add to your Nextcloud** button changes to a form field, and your recipient needs to enter the URL of their Nextcloud or ownCloud server in this field and press the return key, or click the arrow.
pt_br: O botão ** Adicionar ao RIOS ** muda para um campo de formulário e o destinatário precisa inserir o URL do RIOS ou do servidor ownCloud neste campo e pressionar a tecla Enter ou clicar na seta.

source: Next, they will see a dialog asking to confirm. All they have to do is click the **Add remote share** button and they're finished.
pt_br: Em seguida, eles verão uma caixa de diálogo pedindo para confirmar. Tudo o que eles precisam fazer é clicar no botão ** Adicionar compartilhamento remoto ** e pronto.

source: Remove your linked share anytime by clicking the trash can icon. This only unlinks the share, and does not delete any files.
pt_br: Remova seu compartilhamento vinculado a qualquer momento clicando no ícone da lixeira. Isso apenas desvincula o compartilhamento e não exclui nenhum arquivo.
