Repository: aracnus/documentation
Catalog: user_manual/locale/*.rios/LC_MESSAGES/files/file_drop.po
Languages: pt_br

source: Making anonymous uploads
pt_br: Fazer uploads anônimos

source: You may create your own special upload directories so that other people can upload files to you without having to log in to the server, and without being a Nextcloud user. They will not be allowed to see the contents of this directory, or to make any changes. This is an excellent alternative to sending large attachments via email, using an FTP server, or using commercial file-sharing services.
pt_br: Você pode criar seus próprios diretórios de upload especiais para que outras pessoas possam fazer upload de arquivos para você sem ter que fazer login no servidor e sem ser um usuário RIOS. Eles não terão permissão para ver o conteúdo deste diretório ou fazer quaisquer alterações. Esta é uma excelente alternativa para enviar grandes anexos por e-mail, usando um servidor FTP ou usando serviços comerciais de compartilhamento de arquivos.

source: Setting up your own file drop
pt_br: Configurando seu próprio depósito de arquivos

source: Go to Files and create or choose the folder, the anonymous upload should be made to:
pt_br: Vá para Arquivos e crie ou escolha a pasta, o envio anônimo deve ser feito para:

source: Check Share Link, Allow editing, Hide file listing:
pt_br: Marque Compartilhar link, Permitir edição, Ocultar lista de arquivos:

source: Now you can send the link to the upload folder manually or by using the Nextcloud send function, if your administrator has enabled it.
pt_br: Agora você pode enviar o link para a pasta de upload manualmente ou usando a função de envio do RIOS, se seu administrador a habilitou.

source: Uploading files
pt_br: Carregando arquivos

source: Using the anonymous upload function is simple. You receive a link to the upload folder, click the link, and then you'll see a Nextcloud page with a "**Click to upload**" button:
pt_br: Usar a função de upload anônimo é simples. Você receberá um link para a pasta de upload, clique no link e, em seguida, verá uma página RIOS com um botão "**Clique para enviar**":

source: This opens a file picker, and you select the file or directory you want to upload. You're also able to just drop files into the window.
pt_br: Isso abre um seletor de arquivos e você seleciona o arquivo ou diretório que deseja carregar. Você também pode simplesmente soltar arquivos na janela.

source: When your upload is completed, the filenames are listed:
pt_br: Quando o upload for concluído, os nomes dos arquivos serão listados:
