Repository: aracnus/documentation
Catalog: user_manual/locale/*.rios/LC_MESSAGES/files/version_control.po
Languages: pt_br

source: Version control
pt_br: Controle de versão

source: Nextcloud supports simple version control system for files. Versioning creates backups of files which are accessible via the Versions tab on the Details sidebar. This tab contains the history of the file where you can roll back a file to any previous version. Changes made at intervals greater than two minutes are saved in **data/[user]/files_versions**.
pt_br: RIOS suporta sistema de controle de versão simples para arquivos. O controle de versão cria backups de arquivos que podem ser acessados por meio da guia Versões na barra lateral Detalhes. Esta guia contém o histórico do arquivo onde você pode reverter um arquivo para qualquer versão anterior. As alterações feitas em intervalos superiores a dois minutos são salvas em **data/[user]/files_versions**.

source: To restore a specific version of a file, click the circular arrow to the left. Click on the timestamp to download it.
pt_br: Para restaurar uma versão específica de um arquivo, clique na seta circular à esquerda. Clique no carimbo de data/hora para fazer o download.

source: The versioning app expires old versions automatically to make sure that the user doesn't run out of space. This pattern is used to delete old versions:
pt_br: O aplicativo de controle de versão expira versões antigas automaticamente para garantir que o usuário não fique sem espaço. Este padrão é usado para excluir versões antigas:

source: For the first second we keep one version
pt_br: No primeiro segundo, mantemos uma versão

source: For the first 10 seconds Nextcloud keeps one version every 2 seconds
pt_br: Pelos primeiros 10 segundos, RIOS mantém uma versão a cada 2 segundos

source: For the first minute Nextcloud keeps one version every 10 seconds
pt_br: Para o primeiro minuto RIOS mantém uma versão a cada 10 segundos

source: For the first hour Nextcloud keeps one version every minute
pt_br: Pela primeira hora, RIOS mantém uma versão a cada minuto

source: For the first 24 hours Nextcloud keeps one version every hour
pt_br: Nas primeiras 24 horas, o RIOS mantém uma versão a cada hora

source: For the first 30 days Nextcloud keeps one version every day
pt_br: Pelos primeiros 30 dias, RIOS mantém uma versão todos os dias

source: After the first 30 days Nextcloud keeps one version every week
pt_br: Após os primeiros 30 dias, o RIOS mantém uma versão por semana

source: The versions are adjusted along this pattern every time a new version gets created.
pt_br: As versões são ajustadas de acordo com esse padrão sempre que uma nova versão é criada.

source: The version app never uses more that 50% of the user's currently available free space. If the stored versions exceed this limit, Nextcloud deletes the oldest versions until it meets the disk space limit again.
pt_br: A versão do aplicativo nunca usa mais de 50% do espaço livre disponível atualmente do usuário. Se as versões armazenadas excederem esse limite, o RIOS exclui as versões mais antigas até atingir o limite de espaço em disco novamente.
