Repository: aracnus/documentation
Catalog: user_manual/locale/*.rios/LC_MESSAGES/groupware/calendar.po
Languages: pt_br

source: If you do not see the birthday calendar, your Administrator may have disabled this for your server.
pt_br: Se você não vir o calendário de aniversários, o administrador pode ter desativado isso para o seu servidor.

source: Appointments
pt_br: Compromissos

source: As of Calendar v3 the app can generate appointment slots which other Nextcloud users but also people without an account on the instance can book. Appointments offer fine-granular control over when you are possibly free to meet up. This can eliminate the need to send emails back and forth to settle on a date and time.
pt_br: A partir do Calendar v3, o aplicativo pode gerar horários de agendamento que outros usuários do Nextcloud, mas também pessoas sem uma conta na instância, podem agendar. Os compromissos oferecem um controle granular fino sobre quando você está possivelmente livre para se encontrar. Isso pode eliminar a necessidade de enviar e-mails para acertar uma data e hora.

source: In this section we'll use the term *organizer* for the person who owns the calendar and sets up appointment slots. The *attendee* is the person who books one of the slots.
pt_br: Nesta seção, usaremos o termo *organizador* para a pessoa que possui o calendário e configura os horários dos compromissos. O *participante* é a pessoa que reserva um dos slots.

source: Creating an appointment configuration
pt_br: Criando uma configuração de compromisso

source: As an organizer of appointments you open the main Calendar web UI. In the left sidebar you'll find a section for appointments, were you can open the dialogue to create a new one.
pt_br: Como organizador de compromissos, você abre a interface da web principal do Calendário. Na barra lateral esquerda você encontrará uma seção para compromissos, onde você pode abrir o diálogo para criar um novo.

source: One of the basic infos of every appointment is a title describing what the appointment is about, e.g. "One-on-one" when a user wants to offer colleagues a personal call. The duration of the appointment can be picked from a predefined list. Next, you can set the desired increment. The increment is the rate at which possible slots are available. For example, you could have one hour long slots, but you give them away at 30 minute increments so an attendee can book at 9:00AM but also at 9:30AM. Optional infos about location and a description give the attendees some more context.
pt_br: Uma das informações básicas de cada compromisso é um título descrevendo o que é o compromisso, por exemplo, "One-on-one" quando um usuário deseja oferecer aos colegas uma chamada pessoal. A duração do compromisso pode ser escolhida a partir de uma lista predefinida. Em seguida, você pode definir o incremento desejado. O incremento é a taxa na qual os slots possíveis estão disponíveis. Por exemplo, você pode ter horários de uma hora, mas distribuí-los em incrementos de 30 minutos para que um participante possa reservar às 9:00AM, mas também às 9:30AM. Informações opcionais sobre a localização e uma descrição dão aos participantes mais contexto.

source: Every booked appointment will be written into one of your calendars, so you can chose which one that should be. Only slots that do not conflict with existing events in your calendars will be shown to attendees.
pt_br: Cada compromisso reservado será escrito em um de seus calendários, para que você possa escolher qual deve ser. Somente os slots que não entrarem em conflito com os eventos existentes em seus calendários serão mostrados aos participantes.

source: Appointments can be *public* or *private*. Public appointments can be discovered through the profile page of a Nextcloud user. Private appointments are only accessible to the people who receive the secret URL.
pt_br: As consultas podem ser *públicas* ou *privadas*. Os compromissos públicos podem ser descobertos na página de perfil de um usuário do Nextcloud. Os compromissos privados são acessíveis apenas às pessoas que recebem a URL secreta.

source: The organizer of an appointment can specify at which times of the week it's generally possible to book a slot. This could be the working hours but also any other customized schedule.
pt_br: O organizador de um compromisso pode especificar em quais momentos da semana geralmente é possível reservar um horário. Este pode ser o horário de trabalho, mas também qualquer outro horário personalizado.

source: Some appointments require time to prepare, e.g. when you meet at a venue and you have to drive there. The organizer can chose to select a time duration that must be free. Only slots that do not conflict with other events during the preparation time will be available. Moreover there is the option to specify a time after each appointment that has to be free.
pt_br: Alguns compromissos exigem tempo para se preparar, por exemplo. quando você se encontra em um local e você tem que dirigir até lá. O organizador pode optar por selecionar uma duração de tempo que deve ser livre. Apenas vagas que não entrem em conflito com outros eventos durante o tempo de preparação estarão disponíveis. Além disso, existe a opção de especificar um horário após cada consulta que deve ser gratuito.

source: To prevent an attendee from booking too short notice it's possible to configure how soon the next possible appointment might take place.
pt_br: Para evitar que um participante reserve com pouca antecedência, é possível configurar em quanto tempo o próximo compromisso possível ocorrerá.

source: Setting a maximum number of slots per day can limit how many appointments are possibly booked by attendees.
pt_br: Definir um número máximo de vagas por dia pode limitar quantos compromissos são possivelmente reservados pelos participantes.

source: The configured appointment will then be listed in the left sidebar. You can copy its link and share it with the target attendees, or let them discover your public appointment via the profile page.
pt_br: O compromisso configurado será então listado na barra lateral esquerda. Você pode copiar seu link e compartilhá-lo com os participantes-alvo ou permitir que eles descubram seu compromisso público por meio da página de perfil.

source: Booking an appointment
pt_br: Reservando um horário

source: The booking page shows an attendee the title, location, description and length of an appointment. For a selected day there will be a list with all the possible time slots. On days with no available slots, too many conflicts or a reached daily maximum limit of already booked appointments, the list might be empty.
pt_br: A página de reserva mostra a um participante o título, local, descrição e duração de um compromisso. Para um dia selecionado, haverá uma lista com todos os horários possíveis. Em dias sem horários disponíveis, muitos conflitos ou um limite máximo diário atingido de compromissos já agendados, a lista pode estar vazia.

source: For the booking users have to enter a name and an email address. Optionally they can also add a comment.
pt_br: Para a reserva, os usuários devem inserir um nome e um endereço de e-mail. Opcionalmente, eles também podem adicionar um comentário.

source: To verify that the email is valid, a confirmation email will be sent. Only after clicking the confirmation link from the email the appointment booking will be finished. Until then the time slot might also be booked by another user who confirms their booking earlier. The system will detect the conflict and offer to pick a new time slot.
pt_br: Para verificar se o e-mail é válido, um e-mail de confirmação será enviado. Somente após clicar no link de confirmação do e-mail, a reserva do agendamento será finalizada. Até lá, o horário também pode ser reservado por outro usuário que confirme sua reserva com antecedência. O sistema detectará o conflito e se oferecerá para escolher um novo horário.

source: Working with the booked appointment
pt_br: Trabalhando com o compromisso reservado

source: Once the booking is done, the organizer will find an event in their calendar with the appointment details and the :ref:`attendee<calendar-attendees>`. As with any other event that has attendees, changes and cancellations will trigger a notification to the attendee's email.
pt_br: Assim que a reserva for feita, o organizador encontrará um evento em seu calendário com os detalhes do compromisso e o :ref:`participante<calendar-attendees>`. Como em qualquer outro evento que tenha participantes, alterações e cancelamentos acionarão uma notificação no e-mail do participante.

source: If attendees wish to cancel the appointment they have to get in contact with the organizer, so that the organizer can cancel or even delete the event.
pt_br: Caso os participantes desejem cancelar o agendamento devem entrar em contato com o organizador, para que o organizador possa cancelar ou até mesmo excluir o evento.
