Repository: aracnus/documentation
Catalog: user_manual/locale/*.rios/LC_MESSAGES/groupware/calendar.po
Languages: pt_br

source: Using the Calendar app
pt_br: Usando o aplicativo Calendar

source: The Calendar app comes installed with Nextcloud Hub by default, but can be disabled. Please ask your Administrator for it.
pt_br: O aplicativo Calendário vem instalado com o Nextcloud Hub por padrão, mas pode ser desabilitado. Por favor, pergunte ao seu Administrador.

source: The Nextcloud Calendar app works similar to other calendar applications you can sync your Nextcloud calendars and events with.
pt_br: O aplicativo Nextcloud Calendar funciona de forma semelhante a outros aplicativos de calendário com os quais você pode sincronizar seus calendários e eventos Nextcloud.

source: When you first access the Calendar app, a default first calendar will be created for you.
pt_br: Ao acessar o aplicativo Calendário pela primeira vez, um primeiro calendário padrão será criado para você.

source: Managing your calendars
pt_br: Gerenciando seus calendários

source: Create a new Calendar
pt_br: Criar um novo calendário

source: If you plan on setting up a new calendar without transferring any old data from your previous calendar, creating a new calendar is the way you should go.
pt_br: Se você planeja configurar um novo calendário sem transferir nenhum dado antigo do calendário anterior, criar um novo calendário é o caminho a seguir.

source: Click on ``+ New Calendar`` in the left sidebar.
pt_br: Clique em `` + Novo Calendário`` na barra lateral esquerda.

source: Type in a name for your new calendar, e.g. "Work", "Home" or "Marketing planning".
pt_br: Digite um nome para seu novo calendário, por exemplo "Trabalho", "Casa" ou "Planejamento de marketing".

source: After clicking on the checkmark, your new calendar is created and can be synced across your devices, filled with new events and shared with your friends and colleagues.
pt_br: Depois de clicar na marca de seleção, seu novo calendário é criado e pode ser sincronizado em seus dispositivos, preenchido com novos eventos e compartilhado com seus amigos e colegas.

source: Import a Calendar
pt_br: Importar um Calendário

source: If you want to transfer your calendar and their respective events to your Nextcloud instance, importing is the best way to do so.
pt_br: Se você deseja transferir seu calendário e seus respectivos eventos para sua instância Nextcloud, importar é a melhor maneira de fazer isso.

source: Click on the settings-icon labeled with ``Settings & Import`` at the left-bottom.
pt_br: Clique no ícone de configurações rotulado como ``Configurações e importação`` no canto inferior esquerdo.

source: After clicking on ``+ Import Calendar`` you can select one or more calendar files from your local device to upload.
pt_br: Depois de clicar em `` + Importar calendário``, você pode selecionar um ou mais arquivos de calendário de seu dispositivo local para enviar.

source: The upload can take some time and depends on how big the calendar you import is.
pt_br: O envio pode levar algum tempo e depende do tamanho do calendário que você importa.

source: The Nextcloud Calendar application only supports iCalendar-compatible ``.ics``-files, defined in RFC 5545.
pt_br: O aplicativo Calendário Nextcloud suporta apenas arquivos `` .ics`` compatíveis com iCalendar, definidos no RFC 5545.

source: Edit, Export or Delete a Calendar
pt_br: Editar, exportar ou excluir um calendário

source: Sometimes you may want to change the color or the entire name of a previous imported or created calendar. You may also want to export it to your local hard drive or delete it forever.
pt_br: Às vezes, você pode querer alterar a cor ou o nome completo de um calendário importado ou criado anteriormente. Você também pode exportá-lo para o disco rígido local ou excluí-lo para sempre.

source: Please keep in mind that deleting a calendar is a irreversible action. After deletion, there is no way of restoring the calendar unless you have a local backup.
pt_br: Lembre-se de que excluir um calendário é uma ação irreversível. Após a exclusão, não há como restaurar o calendário, a menos que você tenha um backup local.

source: Click on the three-dot-menu of the respective calendar.
pt_br: Clique no menu de três pontos do respectivo calendário.

source: Click on *Edit name*, *Edit color*, *Export* or *Delete*.
pt_br: Clique em *Editar nome*, *Editar cor*, *Exportar* ou *Excluir*.

source: Sharing calendars
pt_br: Compartilhando calendários

source: You may share your calendar with other users or groups. Calendars may be shared with write access or read-only. When sharing a calendar with write access, users with whom the calendar is shared will be able to create new events into the calendar as well as edit and delete existing ones.
pt_br: Você pode compartilhar seu calendário com outros usuários ou grupos. Os calendários podem ser compartilhados com acesso de escrita ou somente leitura. Ao compartilhar um calendário com acesso de escrita, os usuários com quem o calendário é compartilhado poderão criar novos eventos no calendário, bem como editar e excluir os existentes.

source: Calendar shares currently cannot be accepted or rejected. If you want to stop having a calendar that someone shared with you, you can click on the 3-dot menu next to the calendar in the calendar list and click on "Unshare from me". Calendars shared with a group cannot be unshared by individuals.
pt_br: Atualmente, os compartilhamentos de calendário não podem ser aceitos ou rejeitados. Se você quiser deixar de ter um calendário que alguém compartilhou com você, clique no menu de 3 pontos ao lado do calendário na lista de calendários e clique em "Descompartilhar de mim". As agendas compartilhadas com um grupo não podem ser descompartilhadas por indivíduos.

source: Publishing a calendar
pt_br: Publicando um calendário

source: Calendars can be published through a public link to make them viewable (read-only) to external users. You may create a public link by opening the share menu for a calendar and clicking on « + » next to « Share link ». Once created you can copy the public link to your clipboard or send it through email.
pt_br: Os calendários podem ser publicados através de um link público para torná-los visíveis (somente leitura) para usuários externos. Você pode criar um link público abrindo o menu de compartilhamento de um calendário e clicando em « + » próximo a « Compartilhar link ». Depois de criado, você pode copiar o link público para a área de transferência ou enviá-lo por e-mail.

source: There's also an « embedding code » that provides an HTML iframe to embed your calendar into public pages.
pt_br: Existe também um « embedding code » que fornece um iframe HTML para incorporar sua agenda em páginas públicas.

source: Multiple calendars can be shared together by adding their unique tokens to the end of an embed link. Individual tokens can be found at the end of each calendar's public link. The full address will look like ``https://cloud.example.com/index.php/apps/calendar/embed/<token1>-<token2>-<token3>``
pt_br: Vários calendários podem ser compartilhados, adicionando seus tokens exclusivos ao final de um link de incorporação. Os tokens individuais podem ser encontrados no final do link público de cada calendário. O endereço completo será semelhante a `` https://cloud.example.com/index.php/apps/calendar/embed/ <token1>-<token2>-<token3>``

source: To change the default view or date of an embedded calendar, you need to provide an URL that looks like ``https://cloud.example.com/index.php/apps/calendar/embed/<token>/<view>/<date>``. In this url you need to replace the following variables:
pt_br: Para alterar a visualização padrão ou a data de um calendário incorporado, você precisa fornecer um URL que se pareça com ``https://cloud.example.com/index.php/apps/calendar/embed/<token>/<view>/<date>``. Nesta url você precisa substituir as seguintes variáveis:

source: ``<token>`` with the calendar's token,
pt_br: ``<token>`` com o símbolo do calendário,

source: ``<view>`` with one of ``dayGridMonth``, ``timeGridWeek``, ``timeGridDay``, ``listMonth``, ``listWeek``, ``listDay``. The default view is ``dayGridMonth`` and the normally used list is ``listMonth``,
pt_br: ``<view>`` com um dos ``diaGradeMês``, ``gradedetemoSemana``, ``gradedetempoDia``, ``listarMês``, ``listarSemana``, ``listarDia``. A visualização padrão é ``diaGradeMês`` e a lista normalmente usada é ``listarMês``,

source: ``<date>`` with ``now`` or any date with the following format ``<year>-<month>-<day>`` (e.g. ``2019-12-28``).
pt_br: ``<date>`` com `` now``(agora) ou qualquer data com o seguinte formato ``<year>-<month>-<day>`` (e.x. ``2019-12-28``).

source: On the public page, users are able to get the subscription link for the calendar and export the whole calendar directly.
pt_br: Na página pública, os usuários podem obter o link de assinatura do calendário e exportar o calendário inteiro diretamente.

source: Subscribe to a Calendar
pt_br: Inscreva-se em um calendário

source: You can subscribe to iCal calendars directly inside of your Nextcloud. By supporting this interoperable standard (RFC 5545) we made Nextcloud calendar compatible to Google Calendar, Apple iCloud and many other calendar-servers you can exchange your calendars with, including subscription links from calendar published on other Nextcloud instances, as described above.
pt_br: Você pode se inscrever em calendários iCal diretamente no Nextcloud. Ao suportar este padrão interoperável (RFC 5545), tornamos o calendário Nextcloud compatível com o Google Calendar, Apple iCloud e muitos outros servidores de calendário com os quais você pode trocar seus calendários, incluindo links de assinatura de calendário publicado em outras instâncias do Nextcloud, conforme descrito acima.

source: Click on ``+ New Subscription`` in the left sidebar.
pt_br: Clique em `` + Nova Subscrição`` na barra lateral esquerda.

source: Type in or paste the link of the shared calendar you want to subscribe to.
pt_br: Digite ou cole o link do calendário compartilhado que deseja assinar.

source: Finished. Your calendar subscriptions will be updated regularly.
pt_br: Finalizado. Suas assinaturas de calendário serão atualizadas regularmente.

source: Subscriptions are refreshed every week by default. Your administrator may have changed this setting.
pt_br: As assinaturas são atualizadas todas as semanas por padrão. Seu administrador pode ter alterado esta configuração.

source: Managing Events
pt_br: Gerenciando Eventos

source: Create a new event
pt_br: Criar um novo evento

source: Events can be created by clicking in the area when the event is scheduled. In the day- and week-view of the calendar you just click, pull and release your cursor over the area when the event is taking place.
pt_br: Os eventos podem ser criados clicando na área quando o evento está agendado. Na visualização do dia e da semana do calendário, basta clicar, puxar e soltar o cursor sobre a área quando o evento estiver ocorrendo.

source: The month-view only requires a single click into the area of the target day.
pt_br: A visualização do mês requer apenas um único clique na área do dia alvo.

source: After that, you can type in the event's name (e.g. **Meeting with Lukas**), choose the calendar in which you want to save the event to (e.g. **Personal**, **Work**), check and concretize the time span or set the event as an all-day event. Optionally you can specify a location and a description.
pt_br: Depois disso, você pode digitar o nome do evento (por exemplo, **Reunião com Lukas**), escolher o calendário no qual deseja salvar o evento (por exemplo, **Pessoal**, **Trabalho**), marcar e concretize o intervalo de tempo ou defina o evento como um evento de dia inteiro. Opcionalmente, você pode especificar um local e uma descrição.

source: If you want to edit advanced details such as the **Attendees** or **Reminders**, or if you want to set the event as a repeating-event, click on the ``More`` button to open the advanced sidebar editor.
pt_br: Se você quiser editar detalhes avançados, como **Participantes** ou **Lembretes**, ou se quiser definir o evento como um evento de repetição, clique no botão ``Mais`` para abrir a barra lateral avançada editor.

source: If you always want to open the advanced sidebar editor instead of the simple event editor popup, you can set a ``Skip simple event editor`` checkmark in the ``Settings & Import`` section of the app.
pt_br: Se você sempre deseja abrir o editor avançado da barra lateral em vez do pop-up do editor de eventos simples, você pode definir uma marca de seleção ``Pular editor de eventos simples`` na seção ``Configurações & Importação`` do aplicativo.

source: Clicking on the blue ``Create`` button will finally create the event.
pt_br: Clicar no botão azul ``Criar`` irá finalmente criar o evento.

source: Edit or delete an event
pt_br: Editar ou excluir um evento

source: If you want to edit or delete a specific event, you just need to click on it. After that you will be able to re-set all event details and open the advanced sidebar-editor by clicking on ``More``.
pt_br: Se você deseja editar ou deletar um evento específico, você só precisa clicar nele. Depois disso, você será capaz de redefinir todos os detalhes do evento e abrir o editor de barra lateral avançado clicando em ``Mais``.

source: Clicking on the ``Update`` button will update the event. To cancel your changes, click on the close icon on top right of the popup or sidebar editor.
pt_br: Clicar no botão ``Atualizar`` atualizará o evento. Para cancelar suas alterações, clique no ícone fechar no canto superior direito do editor pop-up ou da barra lateral.

source: If you open the sidebar view and click the three dot menu next to the event name, you have an option to export the event as an ``.ics`` file or remove the event from your calendar.
pt_br: Se você abrir a visualização da barra lateral e clicar no menu de três pontos ao lado do nome do evento, terá a opção de exportar o evento como um arquivo `` .ics`` ou remover o evento do seu calendário.

source: If you delete events they will go into your :ref:`trash bin<calendar-trash-bin>`. You can restore accidentally deleted events there.
pt_br: Se você excluir eventos, eles irão para sua :ref:`lixeira<calendar-trash-bin>`. Você pode restaurar eventos excluídos acidentalmente lá.

source: Invite attendees to an event
pt_br: Convide participantes para um evento

source: You may add attendees to an event to let them know they're invited. They will receive an email invitation and will be able to confirm or cancel their participation to the event. Attendees may be other users on your Nextcloud instances, contacts in your address books and direct email addresses. You may also change the level of participation per attendees, or disable the email information for a specific attendee.
pt_br: Você pode adicionar participantes a um evento para que eles saibam que foram convidados. Eles receberão um convite por e-mail e poderão confirmar ou cancelar sua participação no evento. Os participantes podem ser outros usuários em suas instâncias do Nextcloud, contatos em seus catálogos de endereços e endereços de e-mail diretos. Você também pode alterar o nível de participação por participantes ou desabilitar as informações de e-mail de um participante específico.

source: When adding other Nextcloud users as attendees to an event, you may access their free-busy information if available, helping you determine when the best time slot for your event is. Set your :ref:`working hours<calendar-working-hours>` to let others know when you are available. Free-busy information is only available for other users on the same Nextcloud instance.
pt_br: Ao adicionar outros usuários do Nextcloud como participantes de um evento, você pode acessar suas informações de disponibilidade, se disponíveis, ajudando a determinar qual é o melhor horário para o seu evento. Defina seu :ref:`horário de trabalho<calendar-working-hours>` para que outras pessoas saibam quando você estiver disponível. As informações de disponibilidade estão disponíveis apenas para outros usuários na mesma instância do Nextcloud.

source: Only the calendar owner can send out invitations. The sharees are not able to do that, whether they have write access to the event's calendar or not.
pt_br: Somente o proprietário do calendário pode enviar convites. Os compartilhamentos não podem fazer isso, tenham ou não acesso de gravação ao calendário de eventos.

source: The server administration needs to setup the e-mail server in the ``Basic settings`` tab, as this mail will be used to send invitations.
pt_br: A administração do servidor precisa configurar o servidor de e-mail na aba ``Configurações básicas``, pois este e-mail será usado para enviar convites.

source: Assign rooms and resources to an event
pt_br: Atribuir salas e recursos a um evento

source: Similar to attendees you can add rooms and resources to your events. The system will make sure that each room and resource is booked without conflict. The first time a user adds the room or resource to an event, it will show as accepted. Any further events at overlapping times will show the room or resource as rejected.
pt_br: Semelhante aos participantes, você pode adicionar salas e recursos aos seus eventos. O sistema garantirá que cada quarto e recurso seja reservado sem conflito. Na primeira vez que um usuário adicionar a sala ou recurso a um evento, ele será exibido como aceito. Quaisquer outros eventos em horários sobrepostos mostrarão a sala ou o recurso como rejeitado.

source: Rooms and resources are not managed by Nextcloud itself and the Calendar app will not allow you to add or change a resource. Your Administrator has to install and possibly configure resource back ends before you can use them as a user.
pt_br: Salas e recursos não são gerenciados pelo próprio Nextcloud e o aplicativo Calendário não permitirá que você adicione ou altere um recurso. Seu administrador precisa instalar e possivelmente configurar back-ends de recursos antes que você possa usá-los como usuário.

source: Set up reminders
pt_br: Configurar lembretes

source: You can set up reminders to be notified before an event occurs. Currently supported notification methods are:
pt_br: Você pode configurar lembretes para serem notificados antes que um evento ocorra. Os métodos de notificação atualmente suportados são:

source: Email notifications
pt_br: Notificações de e-mail

source: Nextcloud notifications
pt_br: Notificações Nextcloud

source: You may set reminders at a time relative to the event or at a specific date.
pt_br: Você pode definir lembretes em um momento relativo ao evento ou em uma data específica.

source: Only the calendar owner and people or groups with whom the calendar is shared with write access will get notifications. If you don't get any notifications but think you should, your Administrator could also have disabled this for your server.
pt_br: Apenas o proprietário da agenda e as pessoas ou grupos com quem a agenda é compartilhada com acesso de gravação receberão notificações. Se você não receber nenhuma notificação, mas acha que deveria, o administrador também pode ter desativado isso para o seu servidor.

source: If you synchronize your calendar with mobile devices or other 3rd-party clients, notifications may also show up there.
pt_br: Se você sincronizar sua agenda com dispositivos móveis ou outros clientes de terceiros, as notificações também podem aparecer lá.

source: Add recurring options
pt_br: Adicionar opções recorrentes

source: An event may be set as "recurring", so that it can happen every day, week, month or year. Specific rules can be added to set which day of the week the event happens or more complex rules, such as every fourth Wednesday of each month.
pt_br: Um evento pode ser definido como "recorrente", para que aconteça todos os dias, semanas, meses ou anos. Regras específicas podem ser adicionadas para definir em que dia da semana o evento acontece ou regras mais complexas, como toda quarta quarta-feira de cada mês.

source: You can also tell when the recurrence ends.
pt_br: Você também pode dizer quando a recorrência termina.

source: Trash bin
pt_br: Lixeira

source: If you delete events, tasks or a calendar in Calendar, your data is not gone yet. Instead, those items will be collected in a *trash bin*. This offers you to undo a deletion. After a period which defaults to 30 days (your administration may have changed this setting), those items will be deleted permanently. You can also permanently delete items earlier if you wish.
pt_br: Se você excluir eventos, tarefas ou um calendário no Calendário, seus dados ainda não desaparecerão. Em vez disso, esses itens serão coletados em uma *lixeira*. Isso permite desfazer uma exclusão. Após um período padrão de 30 dias (sua administração pode ter alterado essa configuração), esses itens serão excluídos permanentemente. Você também pode excluir itens permanentemente mais cedo, se desejar.

source: The ``Empty trash bin`` buttons will wipe all trash bin contents in one step.
pt_br: Os botões ``Esvaziar lixeira`` limparão todo o conteúdo da lixeira em uma única etapa.

source: The trash bin is only accessible from the Calendar app. Any connected application or app won't be able to display its contents. However, events, tasks and calendars deleted in connected applications or app will also end up in the trash bin.
pt_br: A lixeira só pode ser acessada no aplicativo Agenda. Qualquer aplicativo ou aplicativo conectado não poderá exibir seu conteúdo. No entanto, eventos, tarefas e calendários excluídos em aplicativos ou aplicativos conectados também acabarão na lixeira.

source: Responding to invitations
pt_br: Respondendo a convites

source: You can directly respond to invitations inside the app. Click on the event and select your participation status. You can respond to an invitation by accepting, declining or accepting tentatively.
pt_br: Você pode responder diretamente aos convites dentro do aplicativo. Clique no evento e selecione seu status de participação. Você pode responder a um convite aceitando, recusando ou aceitando provisoriamente.

source: You can respond to an invitation from the sidebar too.
pt_br: Você também pode responder a um convite na barra lateral.

source: Availability (Working Hours)
pt_br: Disponibilidade (Horário de Trabalho)

source: The general availability independent of scheduled events can be set in the groupware settings of Nextcloud. These settings will be reflected in the free-busy view when you :ref:`schedule a meeting with other people<calendar-attendees>` in Calendar. Some connected clients like Thunderbird will show this data as well.
pt_br: A disponibilidade geral independente de eventos agendados pode ser definida nas configurações de groupware do Nextcloud. Essas configurações serão refletidas na visualização de ocupado quando você :ref:`agendar uma reunião com outras pessoas<calendar-attendees>` no Calendário. Alguns clientes conectados, como o Thunderbird, também mostrarão esses dados.

source: Birthday calendar
pt_br: Calendário de aniversários

source: The birthday calendar is a auto-generated calendar which will automatically fetch the birthdays from your contacts. The only way to edit this calendar is by filing your contacts with birthday dates. You can not directly edit this calendar from the calendar-app.
pt_br: O calendário de aniversários é um calendário gerado automaticamente que buscará automaticamente os aniversários de seus contatos. A única maneira de editar este calendário é preenchendo seus contatos com datas de aniversário. Você não pode editar este calendário diretamente a partir do aplicativo de calendário.
